src/main/resources/CBSQueryInvoiceEnhancedTaskService.wsdl

<!--  Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.10-b140319.1121 svn-revision#7b34660d6bc70e587e8ec81a17e4d76af68816a6.  -->
<!--  Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.10-b140319.1121 svn-revision#7b34660d6bc70e587e8ec81a17e4d76af68816a6.  -->
<definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://task.cbs2.adapter.orchestrator.josm.tigo.com.hn/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://task.cbs2.adapter.orchestrator.josm.tigo.com.hn/" name="CBSQueryInvoiceEnhancedTaskService">
<types>
<xsd:schema>
<xsd:import namespace="http://task.cbs2.adapter.orchestrator.josm.tigo.com.hn/" schemaLocation="http://192.168.159.195:7002/CBSQueryInvoiceEnhancedTask/CBSQueryInvoiceEnhancedTaskService?xsd=1"/>
</xsd:schema>
<xsd:schema>
<xsd:import namespace="http://adapter.josm.tigo.com.hn/RequestType/V1" schemaLocation="http://192.168.159.195:7002/CBSQueryInvoiceEnhancedTask/CBSQueryInvoiceEnhancedTaskService?xsd=2"/>
</xsd:schema>
<xsd:schema>
<xsd:import namespace="http://tigo.com/enterprise/resources/parameters/simple/v1/schema" schemaLocation="http://192.168.159.195:7002/CBSQueryInvoiceEnhancedTask/CBSQueryInvoiceEnhancedTaskService?xsd=3"/>
</xsd:schema>
</types>
<message name="executeTask">
<part name="parameters" element="tns:executeTask"/>
</message>
<message name="executeTaskResponse">
<part name="parameters" element="tns:executeTaskResponse"/>
</message>
<message name="AdapterException">
<part name="fault" element="tns:AdapterException"/>
</message>
<portType name="CBSQueryInvoiceEnhancedTask">
<operation name="executeTask">
<input wsam:Action="http://task.cbs2.adapter.orchestrator.josm.tigo.com.hn/CBSQueryInvoiceEnhancedTask/executeTaskRequest" message="tns:executeTask"/>
<output wsam:Action="http://task.cbs2.adapter.orchestrator.josm.tigo.com.hn/CBSQueryInvoiceEnhancedTask/executeTaskResponse" message="tns:executeTaskResponse"/>
<fault message="tns:AdapterException" name="AdapterException" wsam:Action="http://task.cbs2.adapter.orchestrator.josm.tigo.com.hn/CBSQueryInvoiceEnhancedTask/executeTask/Fault/AdapterException"/>
</operation>
</portType>
<binding name="CBSQueryInvoiceEnhancedTaskPortBinding" type="tns:CBSQueryInvoiceEnhancedTask">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="executeTask">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
<fault name="AdapterException">
<soap:fault name="AdapterException" use="literal"/>
</fault>
</operation>
</binding>
<service name="CBSQueryInvoiceEnhancedTaskService">
<port name="CBSQueryInvoiceEnhancedTaskPort" binding="tns:CBSQueryInvoiceEnhancedTaskPortBinding">
<soap:address location="http://192.168.159.195:7002/CBSQueryInvoiceEnhancedTask/CBSQueryInvoiceEnhancedTaskService"/>
</port>
</service>
</definitions>